//Переведите
//Переведите число 333 из 16-ричной в 10-ричную
//
//        Переведите число 819 из 10-ричной в 16-ричную
//
//        101101 в двоичной, переведите в 10-ричную
//
//        124 в десятичной, переведите в 2-ичную
//
//
//        Число 333 в шестнадцатеричной системе равно 819 в десятичной системе 1
//
//        Число 819 в десятичной системе равно 333 в шестнадцатеричной системе 2
//
//        Число 101101 в двоичной системе равно 45 в десятичной системе 3
//
//        Число 124 в десятичной системе равно 1111100 в двоичной системе 45

